# SSD with Mobilenet v2 configuration for MSCOCO Dataset.
# Users should configure the fine_tune_checkpoint field in the train config as
# well as the label_map_path and input_path fields in the train_input_reader and
# eval_input_reader. Search for "PATH_TO_BE_CONFIGURED" to find the fields that
# should be configured.

model {
  ssd {
    num_classes: 1
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 5.0
        x_scale: 5.0
        height_scale: 2.5
        width_scale: 2.5
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.95
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.3333
        aspect_ratios: 1.5
        aspect_ratios: 0.7
        aspect_ratios: 4.0
        aspect_ratios: 0.25
         

      }
    }
    image_resizer {
      fixed_shape_resizer {
        height: 512
        width: 512
      }
    }
    

box_predictor {
      convolutional_box_predictor {
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 1
        box_code_size: 4
        apply_sigmoid_to_scores: false
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.03
              mean: 0.0
            }
          }
          batch_norm {
            train: true,
            scale: true,
            center: true,
            decay: 0.9997,
            epsilon: 0.001,
          }
        }
      }
    }
    feature_extractor {
      type: 'ssd_mobilenet_v2'
      min_depth: 16
      depth_multiplier: 1.0
      conv_hyperparams {
        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          train: true,
          scale: true,
          center: true,
          decay: 0.9997,
          epsilon: 0.001,
        }
      }
    }
    loss {
      classification_loss {
        weighted_sigmoid {
	        }
      }
      localization_loss {
        weighted_smooth_l1 {
	        }
      }
     hard_example_miner {
        num_hard_examples: 3000
        iou_threshold: 0.0
        loss_type: CLASSIFICATION
        max_negatives_per_positive: 3
        min_negatives_per_image: 3
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-4
        iou_threshold: 0.0
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  batch_size: 16
  optimizer {
    rms_prop_optimizer: {
	learning_rate: {
        cosine_decay_learning_rate {
          learning_rate_base: .002
          total_steps: 10000
          warmup_learning_rate: .002
          warmup_steps: 100
        }
     }
      momentum_optimizer_value: 0.9
      decay: 0.9
      epsilon: 1.0
    }
  }
#optimizer {
#    momentum_optimizer: {
#      learning_rate: {
#        cosine_decay_learning_rate {
#          learning_rate_base: .004
#          total_steps: 15000
#          warmup_learning_rate: .0025
#          warmup_steps: 500
#        }
#      }
#      momentum_optimizer_value: 0.9
#    }
#    use_moving_average: false
#  }
#optimizer {
#    # momentum_optimizer {
#    adam_optimizer: {
#      learning_rate: {
#        manual_step_learning_rate {
#          initial_learning_rate: .0004
#          schedule {
#            step: 4500
#            learning_rate: .0003
#          }
#          schedule {
#            step: 7000
#            learning_rate: .0002
#          }
#          schedule {
#            step: 10000
#            learning_rate: .0001
#          }
#        }
#      }
#      # momentum_optimizer_value: 0.9
#    }
#    use_moving_average: false
#  }
  fine_tune_checkpoint: "meteorTrainingLab/ssd_mobilenet_v2_coco_2018_03_29/model.ckpt"

  fine_tune_checkpoint_type: "detection"
  from_detection_checkpoint: true
  load_all_detection_checkpoint_vars: false
  # Note: The below line limits the training process to 200K steps, which we
  # empirically found to be sufficient enough to train the pets dataset. This
  # effectively bypasses the learning rate schedule (the learning rate will
  # never decay). Remove the below line to train indefinitely.
   num_steps: 10000
 data_augmentation_options {
    ssd_random_crop {
	
    }
  }
  data_augmentation_options {
    random_horizontal_flip {
   }
  }
  data_augmentation_options {
    random_rotation90 {
   }
  }

  data_augmentation_options {
    random_vertical_flip {
   }
  }
  data_augmentation_options {
    random_rgb_to_gray {
    }
  }
  data_augmentation_options {
    random_adjust_contrast {
    }
  }
  data_augmentation_options {
    random_adjust_saturation {
    }
  }
  data_augmentation_options {
    random_adjust_hue {
    }
  }
  data_augmentation_options {
    random_adjust_brightness {
    }
  }
    
  
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "meteorTrainingLab/data/train32.record"
  }
  label_map_path: "meteorTrainingLab/data/object-detection.pbtxt"
}

eval_config: {
  num_examples: 230
  # Note: The below line limits the evaluation process to 10 evaluations.
  # Remove the below line to evaluate indefinitely.
  max_evals: 40
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "meteorTrainingLab/data/test32.record"
  }
  label_map_path: "meteorTrainingLab/data/object-detection.pbtxt"
  shuffle: false
  num_readers: 1
}
